{
  "events": [
    {
      "id": "startup-weekend",
      "title": "Startup Weekend",
      "date": "2023-11-15",
      "time": "9:00 AM - 5:00 PM",
      "location": "Innovation Hub, Main Campus",
      "description": "A 54-hour event where attendees pitch ideas, form teams, and start companies. Come with an idea or join a team to build a minimum viable product.",
      "fullDescription": "Startup Weekend is an intensive 54-hour event where entrepreneurs, developers, designers, and business development professionals come together to share ideas, form teams, build products, and launch startups. Beginning with open mic pitches on Friday, attendees bring their best ideas and inspire others to join their team. Over Saturday and Sunday, teams focus on customer development, validating their ideas, practicing LEAN Startup Methodologies, and building a minimal viable product. On Sunday evening, teams demo their prototypes and receive valuable feedback from a panel of experts.",
      "image": "/event-001.jpg",
      "joinLink": "https://example.com/join-startup-weekend",
      "tags": ["entrepreneurship", "networking", "pitching"]
    },
    {
      "id": "tech-talk",
      "title": "Tech Talk: AI in Business",
      "date": "2023-12-05",
      "time": "2:00 PM - 4:00 PM",
      "location": "Auditorium, Technology Building",
      "description": "Join us for an insightful discussion on how artificial intelligence is transforming business operations and creating new opportunities.",
      "fullDescription": "This Tech Talk will explore the rapidly evolving landscape of artificial intelligence in business applications. Our panel of industry experts will discuss current AI implementations across various sectors, challenges in adoption, ethical considerations, and future trends. Attendees will gain practical insights on how businesses can leverage AI technologies to improve efficiency, enhance customer experiences, and create competitive advantages. The session will include case studies, live demonstrations, and a Q&A segment where participants can engage directly with our speakers.",
      "image": "/event-002.jpg",
      "joinLink": "https://example.com/join-tech-talk",
      "tags": ["technology", "artificial intelligence", "business"]
    },
    {
      "id": "hackathon",
      "title": "Innovation Hackathon",
      "date": "2024-01-20",
      "time": "10:00 AM - 8:00 PM",
      "location": "Computer Labs, Engineering Building",
      "description": "A day-long coding competition where teams work together to solve real-world problems through technology solutions.",
      "fullDescription": "The Innovation Hackathon is a high-energy, collaborative coding event where participants form teams to tackle real-world challenges through technology solutions. This year's theme focuses on sustainable development, with problem statements provided by local businesses and community organizations. Teams will have 10 hours to conceptualize, design, and develop working prototypes that address these challenges. Mentors from industry and academia will be available throughout the event to provide guidance and support. The day concludes with team presentations and judging, with prizes awarded for the most innovative, impactful, and technically impressive solutions.",
      "image": "/event-003.jpg",
      "joinLink": "https://example.com/join-hackathon",
      "tags": ["coding", "teamwork", "problem-solving"]
    },
    {
      "id": "design-workshop",
      "title": "UX Design Workshop",
      "date": "2024-02-10",
      "time": "1:00 PM - 5:00 PM",
      "location": "Design Studio, Creative Arts Building",
      "description": "Learn the fundamentals of user experience design and apply them to create intuitive, user-friendly digital products.",
      "fullDescription": "This hands-on workshop will introduce participants to the core principles and methodologies of user experience design. Led by experienced UX professionals, the session will cover user research techniques, information architecture, wireframing, prototyping, and usability testing. Participants will work on practical exercises that simulate real-world design challenges, applying what they learn to create intuitive and user-friendly digital interfaces. By the end of the workshop, attendees will have developed a foundational understanding of the UX design process and created their own low-fidelity prototype. This workshop is ideal for students and professionals interested in human-centered design approaches.",
      "image": "/event-004.jpg",
      "joinLink": "https://example.com/join-ux-workshop",
      "tags": ["design", "user experience", "prototyping"]
    }
  ]
}